#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rootabyss/tf-test/runs/run-aLyyJGaW2tiExFKF

Waiting for the plan to start...

Terraform v0.15.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc.test: Refreshing state... [id=vpc-0abf40a835369a489]
aws_subnet.test-d: Refreshing state... [id=subnet-005982c1198d8e6f7]
aws_subnet.test-c: Refreshing state... [id=subnet-0944eb335b99f4579]
aws_subnet.test-b: Refreshing state... [id=subnet-087251466eac52c88]
aws_subnet.test-a: Refreshing state... [id=subnet-06dffce3e797163c4]
aws_security_group.test-allow-all: Refreshing state... [id=sg-0f40b2e1cdae05b12]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_subnet.test-a has been changed
  ~ resource "aws_subnet" "test-a" {
        id                              = "subnet-06dffce3e797163c4"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_subnet.test-b has been changed
  ~ resource "aws_subnet" "test-b" {
        id                              = "subnet-087251466eac52c88"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_subnet.test-c has been changed
  ~ resource "aws_subnet" "test-c" {
        id                              = "subnet-0944eb335b99f4579"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_subnet.test-d has been changed
  ~ resource "aws_subnet" "test-d" {
        id                              = "subnet-005982c1198d8e6f7"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.test_server will be created
  + resource "aws_eip" "test_server" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # aws_instance.test_server will be created
  + resource "aws_instance" "test_server" {
      + ami                                  = "ami-0be9734c9e68b99f4"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "ap-northeast-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-06dffce3e797163c4"
      + tags                                 = {
          + "Name" = "TerraformTestInstance"
        }
      + tags_all                             = {
          + "Name" = "TerraformTestInstance"
        }
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0f40b2e1cdae05b12",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @qilip, Action: `pull_request`*